# MismatchSystemType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..MismatchSystemType Property
BuiltInFailures..::..SystemsFailures Class See Also
---
Cannot add [Element] to System. The System Type for the available connector does not match the System Type ([Type Name]) for the System.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MismatchSystemType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MismatchSystemType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MismatchSystemType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace